app/controllers/posts_controller.rb

def create
@post=Post.new(params[:post])

if @post.save
---
INSERT INTO "posts" ("created_at", "name", "roll", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Mon, 28 May 2012 12:25:27 UTC +00:00], ["name", "mohan"], ["roll", "ug10"], ["updated_at", Mon, 28 May 2012 12:25:27 UTC +00:00]]